
/* _/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/

	FILE	: KeyManager.cpp
	NAME	: Teacher.K

+ ------ Explanation of file --------------------------------------------------------------------------
       
	共通での処理、または汎用性がある関数や変数の実体宣言部

+ _/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/ */

#include <windows.h>
#include <stdio.h>	// --- コンソール用

#include "Common.h"

/* -----------------------------------------------------------------------------------------
|
|       グローバル変数＆オブジェクトの実体宣言
|
+ --------------------------------------------------------------------------------------- */
// --- コンソールウィンドウ
ConsoleWindow g_cWin;	

// --- ウィンドウなどのタイトル
TCHAR g_szAppTitle[ ] = TEXT( "Worldfire" );
TCHAR g_szWndClass[ ] = TEXT( "MasterSample" );

// --- インスタンスハンドル
HINSTANCE g_hInstance = NULL;	

// --- ウインドウハンドル
HWND g_hWindow = NULL;	

// --- キーマネージャー
KeyManager g_key;

// ビットマップデータ
BitmapData g_bDataSprTable[ BMP_DATA_SPR_MAX ] ;	// スプライト用
BitmapData g_bDataBGTable[ BMP_DATA_BG_MAX ] ;		// 背景用

// バックバッファ
HDC g_hBackBuf = NULL ;

// 共有のデバイスコンテキスト
HDC g_hWorkBuf = NULL ;

// バックドロップ
BackDropScreen g_bScreen ;

// バックグラウンド
BackGround g_bgScreen[ BMP_DATA_BG_MAX ] ;

// スプライト
Sprite g_Spr[ BMP_DATA_SPR_MAX ] ;

// BGM
SoundBGM g_sBGM ;

// SE
SoundSE g_sSE ;

// シーンループ
int g_sceneNo ;

// マップデータ
int g_mapData01[ MAP_X * MAP_Y ] =
{
	 0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
	 0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
	 0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
	 0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
	 0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
	 0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
	 0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
	 0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
	 0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
	 0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
	 0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
	 0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
	 0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
	 0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
	 0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
	 0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
	 0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
	 0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
} ;

// チップテーブル
BitmapData g_bDataCBGTable[ BMP_DATA_CBG_MAX ] ;

// チップテーブル
ChipBackGround g_CBG ;

// プレイヤー
Player g_player ;

// マップデータ吐き出し
CreateData g_cmap ;


/* -----------------------------------------------------------------------------------------
|
|       グローバル関数の実装部
|
+ --------------------------------------------------------------------------------------- */

